# З вхідної стрічки виділити всі підрядки, довжиною більше 5 та вивести їх у сортованому вигляді

# Ви маєте дописати логіку сортування масиву зі всіх слів з вхідного речення,
# довжина яких є строго більшою за 5.

class Calculator
  def string_sort 
    input_string="Hello my brilliant friend!"
    # вхідний рядок записуватиметься у змінну temp
    temp = input_string

    # temp слід розділити на множину підрядків за пробіл
    temp=temp.split(" ")
    puts temp
    # з отриманої множини вибрати лишень ті елементи, довжина яких більша за 5
    result=temp.find_all{|t| t.size>5}.sort

    # посортувати масив та вивести його
    #result = temp.sort

    # тут його слід вивести
    puts ("Відсортовані слова #{result}")

  end
end